## The Basic

In [2]:
#printing data types
temp= 20
print(type(temp))

<class 'int'>

In [3]:
#joining two strings
import pandas as pd
import requests

str='dasdsa'
str2='adasdsadada'
combo=str + ' ' + str2
print(combo)

dasdsa adasdsadada

In [ ]:
#input variable example
num=input('input something')
print(type(num))
print(num,'something')

In [ ]:
#list enumeration
list=['paris','tokyo','Los Angeles','New York']
for index, item in enumerate(list):
    print(index, item)
print(list[1:3])

0 paris
1 tokyo
2 Los Angeles
3 New York
['tokyo', 'Los Angeles']

In [ ]:
#print position example
num=[1,3,4,5,6,7]
print(len(num)-1)

5

In [ ]:
#empty list and extend example
l=[]
l.extend([1,2,3,4,5])

In [ ]:
#dictionary example~~~~~~~~~~~~~~~~~~~~~~
user_profile = {
    "username": "john_doe_123",
    "first_name": "John",
    "last_name": "Doe",
    "email": "john.doe@example.com",
    "age": 28,
    "country": "USA",
    "city": "New York",
    "address": "123 Main St",
    "phone": "123-456-7890",
    "gender": "Male",
    "occupation": "Software Developer",
    "company": "Tech Corp",
    "website": "www.johndoe.com",
    "joined": "2020-05-01",
    "last_login": "2023-10-01",
    "followers": 4500,
    "following": 328,
    "posts": 120,
    "likes": 15000,
    "profile_pic": "path/to/profile_pic.jpg"
}

# Accessing a value by its key
age=user_profile['age']
followers=user_profile['followers']
print(age)

28

In [ ]:
#basic if statement example 1
answer=input()
if answer[0]>='A' and answer[0]<='Z':
    print('uppercase')
else:
    print('lowercase')

lowercase

In [ ]:
#basic if statement example 2
age=input('enter your age' )
age=int(age)
print(age)

if age>=12 and age<=26:
    print('youth advantage card')
elif age>=27 and age<=59:
    print('adult advantage card')
elif age>=60:
    print('Senior advantage card')
else:
    pass
    print('free!!!!!!!!!!!!!!!!!!!!!!')

2
free!!!!!!!!!!!!!!!!!!!!!!

In [ ]:
country=['paris','london','peking','tokyo','Vienna']
for c in country:
    print(c)

paris
london
peking
tokyo
Vienna

In [ ]:
country=['paris','london','peking','tokyo','Vienna']
for index,element in enumerate(country):
    print(index,element)

0 paris
1 london
2 peking
3 tokyo
4 Vienna

In [ ]:
l=[]
for i in range(5):
    l.append(i)
    print(l)

[0]
[0, 1]
[0, 1, 2]
[0, 1, 2, 3]
[0, 1, 2, 3, 4]

In [ ]:
l=[]
for i in range(3,(17),2):
    l.append(i)
    print(l)

[3]
[3, 5]
[3, 5, 7]
[3, 5, 7, 9]
[3, 5, 7, 9, 11]
[3, 5, 7, 9, 11, 13]
[3, 5, 7, 9, 11, 13, 15]

In [ ]:
l=[]
for i in range(0,4):
    for j in range(2,7):
        print(i,j)

0 2
0 3
0 4
0 5
0 6
1 2
1 3
1 4
1 5
1 6
2 2
2 3
2 4
2 5
2 6
3 2
3 3
3 4
3 5
3 6

In [ ]:
l=[]
num=int(6)
for i in range(0,num,1):
    print(i)

0
1
2
3
4
5

In [ ]:
l=[]
num=int(6)
for i in range(0,num+1,1):
    print(i)

0
1
2
3
4
5
6

In [ ]:
l=[]
num=int(6)
for i in range(num):
    print(i)

0
1
2
3
4
5

In [ ]:
l=[]
num=int(6)
for i in range(0,num+1):
    print(i)

0
1
2
3
4
5
6

In [ ]:
l=[]
num=int(6)
for i in range(0,num+1,1):
    print(i)

0
1
2
3
4
5
6

In [ ]:
l=[]
num=int(6)
for i in range(1,num):
    print(i)

1
2
3
4
5

In [ ]:
l=[]
num=int(6)
for i in range(2,num,1):
    print(i)

2
3
4
5

In [ ]:
l=[]
num=int(6)
for i in range(2,num+1,1):
    print(i)

2
3
4
5
6

In [ ]:
l=[]
num=int(6)
for i in range(2,num):
    print(i)

2
3
4
5

In [ ]:
l=[]
num=int(6)
for i in range(2,num+1):
    print(i)

2
3
4
5
6

In [ ]:
l=[]
num=int(6)
for i in range(num+1):
    print(i)

0
1
2
3
4
5
6

In [ ]:
l=[]
num=int(6)
for i in range(0,num):
    print(i)

0
1
2
3
4
5

In [ ]:
l=[]
num=int(6)
for i in range(num,0,-1):
    print(i)

6
5
4
3
2
1

In [ ]:
l=[]
num=int(6)
for i in range(num,1,-1):
    print(i)

6
5
4
3
2

In [ ]:
l=[]
num=int(6)
for i in range(num,0):
    print(i)

In [ ]:
l=[]
num=int(6)
for i in range(num,2,-1):
    print(i)

6
5
4
3

In [ ]:
l=[]
num=int(6)
for i in range(num,2):
    print(i)

In [ ]:
l=[]
num=int(6)
for i in range(num+1,0,-1):
    print(i)

7
6
5
4
3
2
1

In [ ]:
l=[]
num=int(6)
for i in range(num,2,-1):
    print(i)

6
5
4
3

In [ ]:
l=[]
num=int(6)
for i in range(num+1,0):
    print(i)

In [ ]:
l=[]
num=int(6)
for i in range(num+1,2,-1):
    print(i)

7
6
5
4
3

In [133]:
num=int(input('add a number'))

result=1
for i in range(result,num+1):
    result=result*i
    print(result)

1
2

In [ ]:


square= lambda x: x**2
print(square(2))
print(square(-2))

4
4

In [ ]:
cubic= lambda x: x**3
print(cubic(-2))
print(cubic(-2))

-8
-8

In [ ]:
exp= lambda x, b: x**b
print(exp(4,2))
print(exp(4,3))

16
64

In [ ]:
eu_dist= lambda x, y: (x-y)**2
print(eu_dist(4,2))
print(eu_dist(4,3))

4
1

In [ ]:
eu_dist= lambda x, y: (x[0]-y[0])**2+(x[1]-y[1])**2
print(eu_dist([4,1],[2,5]))

20

In [ ]:
def mario_jump():
    print('mario jump..')
mario_jump()

mario jump..

In [ ]:
jump=int(input('how many jumps?'))
def mario_jump(time):
    for t in range(time):
        print('mario jump..')
mario_jump(jump)

mario jump..
mario jump..
mario jump..
mario jump..
mario jump..

In [ ]:
def add(a,b):
    result= a + b
    return result

x,y=2,3
print(add(x,y))

5

## Password checker Example

In [ ]:
password=input('create a password 6 or more chars')

if len(password) >= 6:
    print('password accepted')
else:
    print('password not long enough')

password accepted

In [ ]:
password = input('Create a password (6 or more chars): ')

if len(password) >= 6:
    if any(char.isupper() for char in password):
        print('Password accepted')
    else:
        print('Password must contain at least one uppercase letter')
else:
    print('please try again...')

please try again...

In [ ]:
password = input('Create a password (6 or more chars): ')
def check_password(string):
    flag=False
    for s in string:
        if s.isupper():
            flag=True
            break
    return flag
check_password(password)

letter=check_password(password)
print(letter)

if len(password) >= 6 and letter==True:
     print('Password accepted')
elif len(password) >= 6 and letter==False:
    print('missing upper case char')
elif len(password) < 6 and letter==True:
    print('needs at least 6 chars')
elif len(password) < 6 and letter==False:
    print('needs at least 6 and upper case char')

True
Password accepted

In [ ]:
week=['mon','tue','wed','thu','fri','sat','sun']
for d in range(len(week)):
    print(week[d])

mon
tue
wed
thu
fri
sat
sun

In [ ]:
seq='ACBc'
def check(seq):
    count=0
    for i in range(len(seq)):
        if seq[i] >='A' and seq[i] <='Z':
            count=1
            return count
    return count

In [ ]:
seq='ACBc'
def check(seq):
    count=0
    for i in range(len(seq)):
        if seq[i] >='A' and seq[i] <='Z':
            count=1
            return count
        else:
            pass
    return count

## Basic calculations

In [ ]:
L = [155.49, 155.0, 148.56, 146.92, 143.80]
def calc_mean(seq):
    total = 0
    for element in seq:
        total += element
    
    # Calculate the mean
    mean = total / len(seq)


    return mean

# Call the function with the list L
result = calc_mean(L)
print("mean:", result)

def calc_var(seq):
    total = 0
    for element in seq:
        total += element
    
    # Calculate the mean
    mean = total / len(seq)

    # Calculate the variance
    variance = (sum((element - mean) ** 2 for element in seq)) / len(seq)
    return variance

# Call the function with the list L
result = calc_var(L)
print("Variance:", result)

mean: 149.954
Variance: 21.025904000000008

## Weather data review

In [ ]:
# Libraries used
import os
import sys
import pandas as pd

# Paths and directory
current_directory = os.getcwd()
file = os.path.join(current_directory, "01-data/weather", "weather.txt")
copy = os.path.join(current_directory, "01-data/weather", "weather_copy.txt")

df = pd.read_csv(file)
column_names=['city','temp']
df.columns = column_names

# Access the 'temp' column and store it in a list
temp_list = df['temp']
print(temp_list)

mean_temp = df['temp'].mean()
var_temp=df['temp'].var()


print('#~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~')
print('Mean:',mean_temp)
print('var:',var_temp)
print('mean from fx:', calc_mean(temp_list))
print('variance from fx:', calc_var(temp_list))
print('#~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~')

df.to_csv(copy, index=False)

0    23.3
1    22.8
2    25.0
3    24.2
Name: temp, dtype: float64
#~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
Mean: 23.825
var: 0.9491666666666658
mean from fx: 23.825
variance from fx: 0.7118749999999994
#~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

In [ ]:
import os

root = os.getcwd()
files = [f for f in os.listdir(root) if f.endswith('.ipynb')]

for f in files:
    full_path = os.path.join(root, f)
    print(full_path)

/Users/danramirez/MBS/workspace_class.ipynb

In [ ]:
import random

num= int('input a number between 0  and 100')
while num > 100: 
    num= int('input a number between 0  and 100')
randint=random.randint

### Age guessing example

In [ ]:
import random

max_num = 50
code = random.randint(0, max_num)
print(code)

guess = 0

print('Guess a number between 0 and 50')
while guess != code:
    guess = int(input('What is your guess?'))
    if guess < code:
        print('The number you guessed is too low')
    elif guess > code:
        print('The number you guessed is too high')
    else:
        print('Bingo! You guessed the correct number.')

22
Guess a number between 0 and 50
The number you guessed is too low
The number you guessed is too low
Bingo! You guessed the correct number.

In [ ]:
# Libraries used
import os
import sys
import pandas as pd

# Paths and directory
current_directory = os.getcwd()
file = os.path.join(current_directory, "01-data/DOW30", "Stocks_2021_2023.xlsx")
#copy = os.path.join(current_directory, "01-data/DOW30", "Dow30_2020.xlsx")

df = pd.read_excel(file)
#df.loc[(df['High']>=50) & (df['High']<=100)]
df_group=df.groupby('ticker').mean(df['Close'])
df_group
#df.loc[(df['ticker']=='AAPL') | (df['ticker']=='TSLA')]

ticker
AAPL    153.445022
GOOG    118.653742
META    247.863966
MSFT    279.771100
NVDA    228.888209
PFE      44.116310
PG      144.671433
SHEL     50.968987
TSLA    247.738862
TTE      53.150029
WMT     142.987757
Name: Close, dtype: float64

## Uber data and Pivot table examples

In [4]:
import os
import sys
import pandas as pd

# Paths and directory
current_directory = os.getcwd()
file = os.path.join(current_directory, "01-data/uber", "Uber_supply_demand.xlsx")
#copy = os.path.join(current_directory, "01-data/DOW30", "Dow30_2020.xlsx")

df = pd.read_excel(file)
df.head()

filtered_df = df.loc[(df['status']!='Cancelled')]
filtered_hrs = df.loc[((df['Request_hour'] <= 6) | (df['Request_hour'] >= 23)) & (df['status'] != 'Cancelled')]
filtered_pick = df.loc[((df['Request_hour'] <= 6) | (df['Request_hour'] >= 23)) & (df['status'] != 'Cancelled') & (df['Pickup'] != 'City')]
pivot_table_hr = filtered_df.pivot_table(index='Request_hour', columns='status', values='Request_id', aggfunc='count')
print(pivot_table_hr)
print("~~~~~~~~~~~~~~~~~")
print("~~~~~~~~~~~~~~~~~")
pivot_table_day = filtered_df.pivot_table(index='Weekday', columns='status', values='Request_id', aggfunc='count')
print(pivot_table_day)
print("~~~~~~~~~~~~~~~~~")
print("~~~~~~~~~~~~~~~~~")
pivot_table_pickup = filtered_hrs.pivot_table(index='Pickup', columns='status', values='Request_id', aggfunc='count')
print(pivot_table_pickup)

pivot_table_pickup = filtered_pick.pivot_table(index='Weekday', columns='status', values='Request_id', aggfunc='median')
print(pivot_table_pickup)
print("~~~~~~~~~~~~~~~~~")
print("~~~~~~~~~~~~~~~~~")

#df.loc[(df['ticker']=='AAPL') | (df['ticker']=='TSLA')]

status        No Cars Available  Trip Completed
Request_hour
0                            56              40
1                            56              25
2                            57              37
3                            56              34
4                            74              78
5                            84             185
6                            86             167
7                            63             174
8                            90             155
9                            83             173
10                           65             116
11                           41             115
12                           44             121
13                           53              89
14                           37              88
15                           48             102
16                           46              91
17                          232             151
18                          322             164
19                          283             166
20                          290             161
21                          265             142
22                          138             154
23                           81             103
~~~~~~~~~~~~~~~~~
~~~~~~~~~~~~~~~~~
status     No Cars Available  Trip Completed
Weekday
Friday                   580             561
Monday                   504             601
Thursday                 571             529
Tuesday                  505             562
Wednesday                490             577
~~~~~~~~~~~~~~~~~
~~~~~~~~~~~~~~~~~
status   No Cars Available  Trip Completed
Pickup
Airport                191             331
City                   359             338
status     No Cars Available  Trip Completed
Weekday
Friday                5455.0          5566.0
Monday                  52.0           172.0
Thursday              4102.0          4206.5
Tuesday               1415.0          1523.0
Wednesday             2741.0          2898.0
~~~~~~~~~~~~~~~~~
~~~~~~~~~~~~~~~~~

## Questions on Flight database

### Table Review and Questions

In [7]:
import os
import sys
import pandas as pd
import sqlite3

# Paths and directory
current_directory = os.getcwd()
file = os.path.join(current_directory, "01-data/flightdata", "flight.db")
conn = sqlite3.connect(file)

query =  """

    SELECT
        a.carrier_id,
        b.name,
		a.flight_no,
		a.actual_time,
         d.state as [departsate],
		 c.state as [arrivalstate],
        SUM(a.cancelled) as [Cancelled],
        COUNT(a.arrival_delay) as [Arrival delay count],
        COUNT(a.departure_delay) as [Departure delay count],
        COUNT(a.fid) as [Count of Flight]
    FROM flights a
    LEFT JOIN carriers b ON a.carrier_id = b.cid
    LEFT JOIN airports c ON a.arrival_aid = c.aid
    LEFT JOIN airports d ON a.departure_aid = d.aid
	
    WHERE  a.cancelled = 0 and a.month_id=7  and a.day_of_month=1  and d.state='New York'

	group by        
    	a.carrier_id,
        b.name,
		a.flight_no,
		 d.state,
		 c.state
		 
    ORDER BY a.actual_time DESC
     """

df = pd.read_sql_query(query, conn)

# Close the connection
conn.close()

df

,carrier_id,name,flight_no,actual_time,departsate,arrivalstate,Cancelled,Arrival delay count,Departure delay count,Count of Flight
0,WN,Southwest Airlines Co.,2865,325.0,New York,Nebraska,0,1,1,1
1,WN,Southwest Airlines Co.,1793,323.0,New York,Nebraska,0,1,1,1
2,HP,America West Airlines Inc. (Merged with US Air...,439,289.0,New York,Nebraska,0,1,1,1
3,HP,America West Airlines Inc. (Merged with US Air...,844,288.0,New York,Arizona,0,1,1,1
4,HP,America West Airlines Inc. (Merged with US Air...,842,285.0,New York,Arizona,0,1,1,1
...,...,...,...,...,...,...,...,...,...,...
458,US,US Airways Inc.,1299,43.0,New York,North Carolina,0,1,1,1
459,US,US Airways Inc.,1452,43.0,New York,North Carolina,0,1,1,1
460,US,US Airways Inc.,1047,41.0,New York,North Carolina,0,1,1,1
461,AA,American Airlines Inc.,1511,NaN,New York,Tennessee,0,0,1,1
462,US,US Airways Inc.,1119,NaN,New York,Oregon,0,0,1,1

### Follow up Questions on Flight Database

## Questions on Music Database

### Table review

In [463]:
import os
import sys
import pandas as pd
import sqlite3

# Paths and directory
current_directory = os.getcwd()
file = os.path.join(current_directory, "01-data/musicdata", "pop_music.db")
conn = sqlite3.connect(file)

#SQL queries code blocks~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

#inspecting db tables
queryartists =  """
     select * from artists
     limit 10  
     """

queryalbums =  """
select * from albums
limit 10

     """

querysongs =  """
select * from songs 
limit 10
     """

dfTableArtist = pd.read_sql_query(queryartists, conn)
dfTableAlbums = pd.read_sql_query(queryalbums, conn)
dfTableSongs = pd.read_sql_query(querysongs , conn)
conn.close()

In [464]:
dfTableArtist

   _id                               name
0    1                      Mahogany Rush
1    2                                Elf
2    3                          Mehitabel
3    4  Big Brother & The Holding Company
4    5                         Roy Harper
5    6                        Pat Benatar
6    7                     Rory Gallagher
7    8                        Iron Maiden
8    9                      Blaster Bates
9   10                       Procol Harum

In [465]:
dfTableAlbums

   _id                              name  artist
0    1                Tales of the Crown      16
1    2               The Masquerade Ball      16
2    3                             Grace     159
3    4               Behind Closed Doors     147
4    5                         Day & Age     121
5    6                 Sweet Fanny Adams     172
6    7                     Spem In Alium     199
7    8                 Night In The Ruts     152
8    9                          Impurity      95
9   10  Concerto For Group and Orchestra     196

In [466]:
dfTableSongs

   _id  track                                title  album
0    1      2                I Can't Quit You Baby    343
1    2      1        Taking the Easy Way Out Again    311
2    3      6                   Let's Have A Party    260
3    4      7                    Flaming Telepaths    104
4    5     11                             Yearnin'     37
5    6      1                      Bat Out Of Hell    290
6    7      5                           Evil Woman    143
7    8      7                            Rat Salad     50
8    9      8                     Young is a World    402
9   10      3  Sam With The Showing Scalp Flat Top    429

### Questions

### Q1. Display all the albums by AC DC (note: AC DC is an artist.)

#### Code

In [ ]:
import os
import sys
import pandas as pd
import sqlite3

# Paths and directory
current_directory = os.getcwd()
file = os.path.join(current_directory, "01-data/musicdata", "pop_music.db")
conn = sqlite3.connect(file)

# class questions
musicQ01 =  """
    select distinct b.name as[album], 
    c.name as [artist]

    from songs a
    LEFT JOIN albums b ON a.album = b._id
    LEFT JOIN artists c ON b.artist = c._id

    where c.name like '%AC DC%'
"""

dfmusicQ01 = pd.read_sql_query(musicQ01, conn)
# Close the connection
conn.close()

dfmusicQ01

#### Question 1 Output

In [474]:
dfmusicQ01

                                     album artist
0  For Those About To Rock (We Salute You)  AC DC
1          If You Want Blood You've Got It  AC DC

### Q2. Display all songs by "Beatles"

#### Code

In [ ]:
import os
import sys
import pandas as pd
import sqlite3

# Paths and directory
current_directory = os.getcwd()
file = os.path.join(current_directory, "01-data/musicdata", "pop_music.db")
conn = sqlite3.connect(file)

musicQ02 =  """
select distinct a.title, c.name as [artist]

from songs a
LEFT JOIN albums b ON a.album = b._id
LEFT JOIN artists c ON b.artist = c._id

where c.name like '%beatles%'
     """

dfmusicQ02 = pd.read_sql_query(musicQ02, conn)
conn.close()

#### Question 2 Output

In [477]:
dfmusicQ02

                                              title   artist
0             Sgt. Pepper's Lonely Hearts Club Band  Beatles
1                With A Little Help From My Friends  Beatles
2                     Lucy In The Sky With Diamonds  Beatles
3                                 A Day In The Life  Beatles
4                         Good Morning Good Morning  Beatles
5                                     Fixing A Hole  Beatles
6                                       Lovely Rita  Beatles
7                                She's Leaving Home  Beatles
8                               When I'm Sixty-Four  Beatles
9                 Being For The Benefit Of Mr. Kite  Beatles
10                           Within You Without You  Beatles
11                                   Getting Better  Beatles
12  Sgt. Pepper's Lonely Hearts Club Band (reprise)  Beatles

### Q3. Show all information about the song with love in its title (i.e., song title,album name, and artist name).

#### Code

In [ ]:
current_directory = os.getcwd()
file = os.path.join(current_directory, "01-data/musicdata", "pop_music.db")
conn = sqlite3.connect(file)

musicQ03 =  """
select distinct c.name as [artist],count(a.title) as [Love Song count]

from songs a
LEFT JOIN albums b ON a.album = b._id
LEFT JOIN artists c ON b.artist = c._id
where a.title like '%love%'
group by c.name
order by count(a.title) desc
     """

dfmusicQ03 = pd.read_sql_query(musicQ03 , conn)
conn.close()
dfmusicQ03

#### Question 3 Output

In [479]:
dfmusicQ03

           artist  Love Song count
0    Led Zeppelin               10
1   Fleetwood Mac                9
2     Deep Purple                9
3       Kate Bush                6
4          Troggs                5
..            ...              ...
91    Bad Company                1
92      B.B. King                1
93        Animals                1
94   Alice Cooper                1
95           10cc                1

[96 rows x 2 columns]

### Q4. In the database, which artist or band has recorded the most songs ever?

#### Code

In [ ]:
import os
import sys
import pandas as pd
import sqlite3

# Paths and directory
current_directory = os.getcwd()
file = os.path.join(current_directory, "01-data/musicdata", "pop_music.db")
conn = sqlite3.connect(file)

musicQ04 =  """
select distinct 
c.name as [artist],count(1) as [song count]

from songs a
LEFT JOIN albums b ON a.album = b._id
LEFT JOIN artists c ON b.artist = c._id

group by c.name

order by count(1) desc
limit 1
     """

dfmusicQ04 = pd.read_sql_query(musicQ04 , conn)
conn.close()
dfmusicQ04

#### Question 4 Output

In [480]:
dfmusicQ04

         artist  song count
0  Led Zeppelin         166

### Q5. Show the top 5 artists (including bands) with the most albums.

#### Code

In [ ]:
import os
import sys
import pandas as pd
import sqlite3

# Paths and directory
current_directory = os.getcwd()
file = os.path.join(current_directory, "01-data/musicdata", "pop_music.db")
conn = sqlite3.connect(file)

musicQ05 =  """
select distinct 
b.name as [artist],count(a.name) as [album couunt]

from albums a
LEFT JOIN artists b ON a.artist = b._id

group by b.name
order by count(a.name) desc
limit 5

     """

dfmusicQ05 = pd.read_sql_query(musicQ05 , conn)
conn.close()

#### Question 5 Output

In [481]:
dfmusicQ05

           artist  album couunt
0   Black Sabbath            18
1  Axel Rudi Pell            15
2    Led Zeppelin            14
3     Deep Purple            13
4       Aerosmith            13

### Q6. Show all songs and the album information of each song by Queen,including song title, album name, and artist name. (note: Queen is an artist.)

#### Code

In [ ]:
import os
import sys
import pandas as pd
import sqlite3

# Paths and directory
current_directory = os.getcwd()
file = os.path.join(current_directory, "01-data/musicdata", "pop_music.db")
conn = sqlite3.connect(file)

musicQ06 =  """
select distinct b.name as[album],a.title,c.name

from songs a
LEFT JOIN albums b ON a.album = b._id
LEFT JOIN artists c ON b.artist = c._id

where c.name like '%queen%'

order by b.name
     """

dfmusicQ06 = pd.read_sql_query(musicQ06, conn)
conn.close()

#### Question 6 Output

In [482]:
dfmusicQ06

,album,title,name
0,Innuendo,Headlong,Queen
1,Innuendo,All God's People,Queen
2,Innuendo,The Show Must Go On,Queen
3,Innuendo,Bijou,Queen
4,Innuendo,I Can't Live With You,Queen
5,Innuendo,The Hitman,Queen
6,Innuendo,Innuendo,Queen
7,Innuendo,I'm Going Slightly Mad,Queen
8,Innuendo,Ride the Wild Wind,Queen
9,Innuendo,Delilah,Queen
10,Innuendo,These Are the Days of Our Lives,Queen
11,Innuendo,Don't Try So Hard,Queen
12,Innuendo Disk 2,Headlong (embryo with guide vocal),Queen
13,Innuendo Disk 2,I'm Going Slightly Mad (mad_mix),Queen
14,Innuendo Disk 2,Lost Opportunity (B-Side),Queen
15,Innuendo Disk 2,I Can't Live With You (1997 - Rocks retake),Queen
16,Innuendo Disk 2,Ride the Wild Wind (early version with guide v...,Queen
17,Sheer Heart Attack,In The Lap Of The Gods,Queen
18,Sheer Heart Attack,In The Lap Of The Gods ... Revisited,Queen
19,Sheer Heart Attack,Brighton Rock,Queen
20,Sheer Heart Attack,She Makes Me (Stormtrooper In Stilettos),Queen
21,Sheer Heart Attack,Lily Of The Valley,Queen
22,Sheer Heart Attack,Tenement Funster,Queen
23,Sheer Heart Attack,Now I'm Here,Queen
24,Sheer Heart Attack,Killer Queen,Queen
25,Sheer Heart Attack,Dear Friends,Queen
26,Sheer Heart Attack,Flick Of The Wrist,Queen
27,Sheer Heart Attack,Stone Cold Crazy,Queen
28,Sheer Heart Attack,Bring Back That Leroy Brown,Queen
29,Sheer Heart Attack,Misfire,Queen
30,The Miracle,Breakthru,Queen
31,The Miracle,My Baby Does Me,Queen
32,The Miracle,The Invisible Man,Queen
33,The Miracle,Hang On In There,Queen
34,The Miracle,Chinese Torture,Queen
35,The Miracle,Scandal,Queen
36,The Miracle,The Miracle,Queen
37,The Miracle,I Want It All,Queen
38,The Miracle,Rain Must Fall,Queen
39,The Miracle,Khashoggi's Ship,Queen
40,The Miracle,Was It All Worth It,Queen
41,The Miracle,Party,Queen

## Flight Data Part 2

#### Code

In [256]:
#flight dataset part 2

import os
import sys
import pandas as pd
import sqlite3

# Paths and directory
current_directory = os.getcwd()
file = os.path.join(current_directory, "01-data/flightdata", "flight.db")
conn = sqlite3.connect(file)

queryall =  """

    SELECT
        a.carrier_id,
        b.name,
		a.flight_no,
		a.actual_time,
         d.state as [departsate],
		 c.state as [arrivalstate],
        SUM(a.cancelled) as [Cancelled],
        COUNT(a.arrival_delay) as [Arrival delay count],
        COUNT(a.departure_delay) as [Departure delay count],
        COUNT(a.fid) as [Count of Flight]
    FROM flights a
    LEFT JOIN carriers b ON a.carrier_id = b.cid
    LEFT JOIN airports c ON a.arrival_aid = c.aid
    LEFT JOIN airports d ON a.departure_aid = d.aid
	
    WHERE  a.cancelled = 0 and a.month_id=7  and a.day_of_month=1  and d.state='New York'

	group by        
    	a.carrier_id,
        b.name,
		a.flight_no,
		 d.state,
		 c.state
		 
    ORDER BY a.actual_time DESC
     """

querystate=  """

    SELECT
        a.carrier_id,
        b.name,
		a.flight_no,
		a.actual_time,
         d.state as [departsate],
		 c.state as [arrivalstate],
        SUM(a.cancelled) as [Cancelled],
        COUNT(a.arrival_delay) as [Arrival delay count],
        COUNT(a.departure_delay) as [Departure delay count],
        COUNT(a.fid) as [Count of Flight]
    
    FROM flights a
    LEFT JOIN carriers b ON a.carrier_id = b.cid
    LEFT JOIN airports c ON a.arrival_aid = c.aid
    LEFT JOIN airports d ON a.departure_aid = d.aid
	
    WHERE  a.cancelled = 0 and d.state='California' and c.state='Hawaii' and a.month_id=7

	group by        
    	a.carrier_id,
        b.name,
		a.flight_no,
		 d.state,
		 c.state
    having count(a.fid) >30
		 
    ORDER BY a.actual_time DESC
     """

queryinner=  """

    SELECT 
        carrier_id, 
        count(*) as [count], 
        avg(flights.arrival_delay) as [average delay]
    FROM flights 
    
    Join
    (
	    select departure_aid, 
        arrival_aid, 
        count(*)
        from flights

        group by departure_aid, arrival_aid
        order by count(*) desc
        limit 1
    ) T 
    on flights.departure_aid=T.departure_aid 
    and flights.arrival_aid=T.arrival_aid
    where flights.cancelled=0
    group by carrier_id
    order by count(*) desc

     """

#sql excecution~~~~~~~~~~~~~~~~~~~~~~~~~~~~
dfstate = pd.read_sql_query(querystate, conn)
dfsubquery = pd.read_sql_query(queryinner, conn)

#sql excecution~~~~~~~~~~~~~~~~~~~~~~~~~~~~

# Close the connection
conn.close()

#### Flight data output

In [257]:
print('an example using "having" to filter the group by criteria')
dfstate

an example using "having" to filter the group by criteria

,carrier_id,name,flight_no,actual_time,departsate,arrivalstate,Cancelled,Arrival delay count,Departure delay count,Count of Flight
0,UA,United Air Lines Inc.,43,434.0,California,Hawaii,0,30,31,31
1,HA,Hawaiian Airlines Inc.,15,346.0,California,Hawaii,0,31,31,31
2,UA,United Air Lines Inc.,33,340.0,California,Hawaii,0,31,31,31
3,UA,United Air Lines Inc.,75,337.0,California,Hawaii,0,31,31,31
4,TZ,ATA Airlines d/b/a ATA,4625,334.0,California,Hawaii,0,31,31,31
5,AA,American Airlines Inc.,39,332.0,California,Hawaii,0,31,31,31
6,UA,United Air Lines Inc.,827,328.0,California,Hawaii,0,31,31,31
7,TZ,ATA Airlines d/b/a ATA,4517,327.0,California,Hawaii,0,31,31,31
8,DL,Delta Air Lines Inc.,219,325.0,California,Hawaii,0,31,31,31
9,UA,United Air Lines Inc.,41,323.0,California,Hawaii,0,31,31,31
10,UA,United Air Lines Inc.,63,322.0,California,Hawaii,0,31,31,31
11,UA,United Air Lines Inc.,61,320.0,California,Hawaii,0,31,31,31
12,UA,United Air Lines Inc.,65,320.0,California,Hawaii,0,31,31,31
13,HA,Hawaiian Airlines Inc.,19,319.0,California,Hawaii,0,31,31,31
14,UA,United Air Lines Inc.,59,318.0,California,Hawaii,0,31,31,31
15,UA,United Air Lines Inc.,37,317.0,California,Hawaii,0,31,31,31
16,NW,Northwest Airlines Inc.,85,316.0,California,Hawaii,0,31,31,31
17,HA,Hawaiian Airlines Inc.,11,310.0,California,Hawaii,0,31,31,31
18,UA,United Air Lines Inc.,965,127.0,California,Hawaii,0,31,31,31
19,UA,United Air Lines Inc.,775,112.0,California,Hawaii,0,31,31,31
20,OO,SkyWest Airlines Inc.,6380,98.0,California,Hawaii,0,31,31,31
21,OO,SkyWest Airlines Inc.,6386,98.0,California,Hawaii,0,31,31,31
22,OO,SkyWest Airlines Inc.,6384,90.0,California,Hawaii,0,31,31,31
23,WN,Southwest Airlines Co.,622,78.0,California,Hawaii,0,31,31,31

In [258]:
dfsubquery

  carrier_id  count  average delay
0         UA    720      14.094708
1         AA    232      33.735931
2         DH    177      29.289017
3         MQ    127      26.087302
4         TZ    119       8.899160
5         US    102      28.810000

## Questions on Ecommerce Database

### Table Review

#### Table code

In [437]:
# Customer CustomerID
# Invovice Invovice_ID
# product Pid, Description Unitprice

import os
import sys
import pandas as pd
import sqlite3

# Paths and directory
current_directory = os.getcwd()
file = os.path.join(current_directory, "01-data/ecom", "E_commerce.db")
conn = sqlite3.connect(file)

customer= """
select * from customer
"""

invoice= """
select * from invoice
"""

product= """
select * from product
"""


#sql excecution~~~~~~~~~~~~~~~~~~~~~~~~~~~~
dfcustomer = pd.read_sql_query(customer, conn)
dfinvoice = pd.read_sql_query(invoice, conn)
dfproduct = pd.read_sql_query(product, conn)

#sql excecution~~~~~~~~~~~~~~~~~~~~~~~~~~~~

# Close the connection
conn.close()

#### Table output

In [438]:
dfcustomer

      CustomerID         Country
0          12346  United Kingdom
1          12347         Iceland
2          12348         Finland
3          12349           Italy
4          12350          Norway
...          ...             ...
4367       18280  United Kingdom
4368       18281  United Kingdom
4369       18282  United Kingdom
4370       18283  United Kingdom
4371       18287  United Kingdom

[4372 rows x 2 columns]

In [439]:
dfinvoice

,InvoiceNo,ProductCode,cancelled,Quantity,Invoice_Time,Invoice_Date,CustomerID,Invoice_ID
0,536365,85123A,0,6,08:26:00,2010-12-01,17850,0
1,536365,71053,0,6,08:26:00,2010-12-01,17850,1
2,536365,84406B,0,8,08:26:00,2010-12-01,17850,2
3,536365,84029G,0,6,08:26:00,2010-12-01,17850,3
4,536365,84029E,0,6,08:26:00,2010-12-01,17850,4
...,...,...,...,...,...,...,...,...
406824,581587,22613,0,12,12:50:00,2011-12-09,12680,406824
406825,581587,22899,0,6,12:50:00,2011-12-09,12680,406825
406826,581587,23254,0,4,12:50:00,2011-12-09,12680,406826
406827,581587,23255,0,4,12:50:00,2011-12-09,12680,406827
406828,581587,22138,0,3,12:50:00,2011-12-09,12680,406828

In [440]:
dfinvoice

,InvoiceNo,ProductCode,cancelled,Quantity,Invoice_Time,Invoice_Date,CustomerID,Invoice_ID
0,536365,85123A,0,6,08:26:00,2010-12-01,17850,0
1,536365,71053,0,6,08:26:00,2010-12-01,17850,1
2,536365,84406B,0,8,08:26:00,2010-12-01,17850,2
3,536365,84029G,0,6,08:26:00,2010-12-01,17850,3
4,536365,84029E,0,6,08:26:00,2010-12-01,17850,4
...,...,...,...,...,...,...,...,...
406824,581587,22613,0,12,12:50:00,2011-12-09,12680,406824
406825,581587,22899,0,6,12:50:00,2011-12-09,12680,406825
406826,581587,23254,0,4,12:50:00,2011-12-09,12680,406826
406827,581587,23255,0,4,12:50:00,2011-12-09,12680,406827
406828,581587,22138,0,3,12:50:00,2011-12-09,12680,406828

### Questions

### Q1. Identify the top 10 best-selling products based on the total number of valid transactions?

#### Code

In [ ]:
import os
import sys
import pandas as pd
import sqlite3

# Paths and directory
current_directory = os.getcwd()
file = os.path.join(current_directory, "01-data/ecom", "E_commerce.db")
conn = sqlite3.connect(file)

ecomQ1= """
select
    iv.ProductCode,
    p.Description,
    sum(iv.Quantity) as [units]
    from invoice iv
 join product p on iv.ProductCode=p.Pid
 where iv.cancelled=0

group by 
    iv.ProductCode,
    p.Description
order by sum(iv.Quantity) desc

limit 10
"""
dfecomQ1 = pd.read_sql_query(ecomQ1, conn)
conn.close()

#### Question 1 Output

In [467]:
dfecomQ1

  ProductCode                         Description  units
0       23843         PAPER CRAFT , LITTLE BIRDIE  80995
1       23166      MEDIUM CERAMIC TOP STORAGE JAR  77916
2       84077   WORLD WAR 2 GLIDERS ASSTD DESIGNS  54415
3       22197                SMALL POPCORN HOLDER  49183
4      85099B             JUMBO BAG RED RETROSPOT  46181
5      85123A  WHITE HANGING HEART T-LIGHT HOLDER  36782
6       84879       ASSORTED COLOUR BIRD ORNAMENT  35362
7       21212     PACK OF 72 RETROSPOT CAKE CASES  33693
8       23084                  RABBIT NIGHT LIGHT  27202
9       22492             MINI PAINT SET VINTAGE   26076

### Q2. Calculate the total price of each valid transaction.

#### Code

In [ ]:
import os
import sys
import pandas as pd
import sqlite3

# Paths and directory
current_directory = os.getcwd()
file = os.path.join(current_directory, "01-data/ecom", "E_commerce.db")
conn = sqlite3.connect(file)
ecomQ2= """
select
    iv.ProductCode,
    p.Description,
    p.UnitPrice, 
    sum(iv.Quantity) as [units],
    (sum(iv.Quantity) *  p.UnitPrice) as [total Sales]
    from invoice iv
 join product p on iv.ProductCode=p.Pid
 where iv.cancelled=0

group by 
    iv.ProductCode,
    p.Description,
    p.UnitPrice
order by (sum(iv.Quantity) *  p.UnitPrice) desc
"""
#sql excecution~~~~~~~~~~~~~~~~~~~~~~~~~~~~

dfecomQ2 = pd.read_sql_query(ecomQ2, conn)
conn.close()

#### Question 2 Output

In [468]:
dfecomQ2

,ProductCode,Description,UnitPrice,units,total Sales
0,23843,"PAPER CRAFT , LITTLE BIRDIE",2.080,80995,168469.600
1,22423,REGENCY CAKESTAND 3 TIER,10.950,12412,135911.400
2,85123A,WHITE HANGING HEART T-LIGHT HOLDER,2.550,36782,93794.100
3,23166,MEDIUM CERAMIC TOP STORAGE JAR,1.040,77916,81032.640
4,85099B,JUMBO BAG RED RETROSPOT,1.650,46181,76198.650
...,...,...,...,...,...
3660,90084,PINK CRYSTAL GUITAR PHONE CHARM,0.850,1,0.850
3661,90104,PURPLE FRANGIPANI HAIRCLIP,0.850,1,0.850
3662,21268,VINTAGE BLUE TINSEL REEL,0.420,2,0.840
3663,84227,HEN HOUSE W CHICK IN NEST,0.420,1,0.420
3664,PADS,PADS TO MATCH ALL CUSHIONS,0.001,4,0.004

### Q3. A transaction is not marked as canceled and is considered as a valid transaction. Display valid transactions for purchases of more than or equal to 10 items.

#### Code

In [ ]:
import os
import sys
import pandas as pd
import sqlite3

# Paths and directory
current_directory = os.getcwd()
file = os.path.join(current_directory, "01-data/ecom", "E_commerce.db")
conn = sqlite3.connect(file)

ecomQ3= """
select
    iv.ProductCode,
    p.Description,
    sum(iv.Quantity) as [units]
    from invoice iv
 join product p on iv.ProductCode=p.Pid
 where iv.cancelled=0

group by 
    iv.ProductCode,
    p.Description
having sum(iv.Quantity) >=10
order by sum(iv.Quantity) desc
"""

dfecomQ3 = pd.read_sql_query(ecomQ3, conn)
conn.close()

#### Question 3 Output

In [469]:
dfecomQ3

     ProductCode                        Description  units
0          23843        PAPER CRAFT , LITTLE BIRDIE  80995
1          23166     MEDIUM CERAMIC TOP STORAGE JAR  77916
2          84077  WORLD WAR 2 GLIDERS ASSTD DESIGNS  54415
3          22197               SMALL POPCORN HOLDER  49183
4         85099B            JUMBO BAG RED RETROSPOT  46181
...          ...                                ...    ...
3322       90072      RUBY DROP CHANDELIER EARRINGS     10
3323       90102         WHITE FRANGIPANI HAIR CLIP     10
3324      90162D    ANT SILVER PURPLE BOUDICCA RING     10
3325       90167    BEADED LOVE HEART JEWELLERY SET     10
3326       90208  PAIR OF PINK FLOWER CLUSTER SLIDE     10

[3327 rows x 3 columns]

### Q4. What are the top 10 best-selling products in terms of total sales by price?

#### Code

In [ ]:
import os
import sys
import pandas as pd
import sqlite3

# Paths and directory
current_directory = os.getcwd()
file = os.path.join(current_directory, "01-data/ecom", "E_commerce.db")
conn = sqlite3.connect(file)

ecomQ4= """
select
    iv.ProductCode,
    p.Description,
    p.UnitPrice, 
    sum(iv.Quantity) as [units],
    (sum(iv.Quantity) *  p.UnitPrice) as [total Sales]
    from invoice iv
 join product p on iv.ProductCode=p.Pid
 where iv.cancelled=0

group by 
    iv.ProductCode,
    p.Description,
    p.UnitPrice
order by (sum(iv.Quantity) *  p.UnitPrice) desc
limit 10
"""
dfecomQ4 = pd.read_sql_query(ecomQ4, conn)
conn.close()

#### Question 4 Output

In [470]:
dfecomQ4

,ProductCode,Description,UnitPrice,units,total Sales
0,23843,"PAPER CRAFT , LITTLE BIRDIE",2.08,80995,168469.60
1,22423,REGENCY CAKESTAND 3 TIER,10.95,12412,135911.40
2,85123A,WHITE HANGING HEART T-LIGHT HOLDER,2.55,36782,93794.10
3,23166,MEDIUM CERAMIC TOP STORAGE JAR,1.04,77916,81032.64
4,85099B,JUMBO BAG RED RETROSPOT,1.65,46181,76198.65
5,47566,PARTY BUNTING,4.65,15295,71121.75
6,84879,ASSORTED COLOUR BIRD ORNAMENT,1.69,35362,59761.78
7,23084,RABBIT NIGHT LIGHT,2.08,27202,56580.16
8,POST,POSTAGE,18.00,3120,56160.00
9,23203,JUMBO BAG DOILEY PATTERNS,2.08,19516,40593.28

### Q5. Total number of valid transactions per country.

#### Code

In [ ]:
import os
import sys
import pandas as pd
import sqlite3

# Paths and directory
current_directory = os.getcwd()
file = os.path.join(current_directory, "01-data/ecom", "E_commerce.db")
conn = sqlite3.connect(file)

ecomQ5= """
select
    c.Country,
    count(distinct iv.InvoiceNo) as [transaction]
    from invoice iv
 join product p on iv.ProductCode=p.Pid
 join customer c on iv.CustomerID=c.CustomerID
 where iv.cancelled=0

 group by 
 c.Country
order by count(distinct iv.InvoiceNo) desc
"""
dfecomQ5 = pd.read_sql_query(ecomQ5, conn)
conn.close()

#### Question 5 Output

In [471]:
dfecomQ5

                 Country  transaction
0         United Kingdom        16649
1                Germany          457
2                 France          389
3                   EIRE          260
4                Belgium           98
5            Netherlands           95
6                  Spain           85
7              Australia           60
8               Portugal           57
9            Switzerland           52
10               Finland           41
11                 Italy           38
12                Sweden           36
13                Norway           36
14       Channel Islands           26
15                Poland           19
16                 Japan           19
17                Cyprus           19
18               Denmark           18
19               Austria           15
20           Unspecified            8
21             Singapore            7
22               Iceland            7
23                Canada            6
24                   USA            5
25                 Malta            5
26                Israel            5
27                Greece            5
28             Lithuania            4
29    European Community            4
30  United Arab Emirates            3
31        Czech Republic            2
32               Bahrain            2
33          Saudi Arabia            1
34                   RSA            1
35               Lebanon            1
36                Brazil            1